AntonG97/st7789vw-gd32-driver/src/sku22632.c
/* 
Replace this file with your code. Put your source files in this directory and any libraries in the lib folder. 
If your main program should be assembly-language replace this file with main.S instead.

Libraries (other than vendor SDK and gcc libraries) must have .h-files in /lib/[library name]/include/ and .c-files in /lib/[library name]/src/ to be included automatically.
*/

#include "gd32vf103.h"
#include "../include/sku22632.h"
#include "../include/lcd_font.h"

typedef enum{
	SWRESET = 0x01,	//SW reset
	SLPIN = 0x10,	//LCD power saving mode
	SLPOUT = 0x11, 	//LCD turn off power saving mode
	NORON = 0x13,	//Normal display mode on
	INVOFF = 0x20, 	//Display inversion off
	INVON = 0x21,	//Display inversion on
	GAMSET = 0x26,	//Gamma set
	DISPOFF = 0x28,	//Display OFF
	DISPON = 0x29, 	//Display ON
	CASET = 0x2A,	//Column adress set + 4 bytes of data
	RASET = 0x2B,	//Row adress set + 4 bytes of data
	RAMWR = 0x2C, 	//Memory write. Transfer data from MCU to frame mem. When cmd accepted, col and page set to start pos
	MADCTL = 0x36,	//Memory data access control
	COLMOD = 0x3A,	//Interface pixel format
	WRDISBV = 0x51,	//Write display brightness + 1 byte (0x00 => Lowest 0xFF => Highest)
}cmd;

static void lcd_dma_init(uint32_t _dma_periph, dma_channel_enum _channel, uint32_t _spi_perpih);
static void dma_prep_on(uint32_t number);
static void dma_prep_off(void);

static void lcd_wr_data(const uint8_t data);
static void lcd_wr_cmd(const cmd data);
static void lcd_queue_flush_blocking(void);
static void setWindow(const uint16_t xs, const uint16_t xe, const uint16_t ys, const uint16_t ye);
static void fillWindow(const uint16_t xs, const uint16_t xe, const uint16_t ys, const uint16_t ye, color color);

//Auxillery functions
static void delay_ms(uint16_t ms);

/**
 * SPI base
 */
static uint32_t spi_perpih;
/**
 * DMA base
 */
static uint32_t dma_periph;
/**
 * DMA channel
 */
static dma_channel_enum dma_channel;

/**
 * GPIO base
 */
static uint32_t gpio_perpih;

/**
 * Reset GPIO pin. Active LOW.
 */
static uint32_t rst;

/**
 * Chip select GPIO pin. Active LOW. 
 */
static uint32_t cs;

/**
 * Data/Command selection GPIO pin. 
 * LOW => Cmd
 * HIGH => Data
 */
static uint32_t dc;

/**
 * Variable holds the current background color set during previous call of lcd_clear()
 */
static color curr_backgr;

int main(void){

	lcd_init(SPI0, DMA0, DMA_CH2, GPIOA, GPIO_PIN_5, GPIO_PIN_7, GPIO_PIN_1, GPIO_PIN_2, GPIO_PIN_3);
	//lcd_showPicture(kub_map_v4);

	const color color_list[] = {
    WHITE, BLACK, RED, GREEN, BLUE,
    YELLOW, CYAN, MAGENTA, BROWN, BRRED,
    GRAY, DARKBLUE, LIGHTBLUE, GRAYBLUE,
    LIGHTGREEN, LGRAY, DGRAY, LGRAYBLUE,
    LBBLUE, BRED, GRED, GBLUE
	};

	setWindow(0, LCD_X_MAX, 0, LCD_Y_MAX);				//Set window
	lcd_queue_flush_blocking();

	const int color_count = sizeof(color_list) / sizeof(color_list[0]);

	
	while(1){
		//lcd_queue_flush();
		for (int i = 0; i < color_count; i++) {
		lcd_dma_clear(color_list[i]);
		delay_ms(1000);
		}
	}
	return 0;
}



/**
 * @brief Delays (blocking)
 * @param[in] ms: Amount of ms to delay
 */
static void delay_ms(uint16_t ms){
	volatile long long base = 7200; 	//Base
	base = base*(long long)ms;			//Mult base with ms
	while(--base) __asm__ volatile("nop");
}
static inline void dc_set(void) {
    gpio_bit_set(gpio_perpih, dc);
}

static inline void dc_clr(void) {
    gpio_bit_reset(gpio_perpih, dc);
}

static inline void cs_set(void) {
    gpio_bit_set(gpio_perpih, cs);
}

static inline void cs_clr(void) {
    gpio_bit_reset(gpio_perpih, cs);
}
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//DMA functions begin 

/**
 * LCD data buffer. Fill with pixel value and let DMA transmit to SPI
 * FIX: buffer size
 */
static uint16_t dma_buffer_color;

/**
 * @brief Initialises DMA pherip and channel used by LCD
 * @param[in]: _dma_periph: DMAx(x=0,1)
 * @param[in]: _channel: specify which DMA channel is initialized only one parameter can be selected => 
 * 				DMA0: DMA_CHx(x=0..6), DMA1: DMA_CHx(x=0..4)
 * @param[in]: _spi_periph: SPIx(x=0,1,2).
 */
static void lcd_dma_init(uint32_t _dma_periph, dma_channel_enum _channel, uint32_t _spi_perpih){
	
	rcu_periph_clock_enable(RCU_DMA0);

	dma_periph = _dma_periph;
	dma_channel = _channel;
	dma_channel_disable(dma_periph, dma_channel);


	/**
	 * Initilise dma parameters
	 */
	dma_parameter_struct dma_init_struct;
	dma_struct_para_init(&dma_init_struct);

	//FIX: memory_addr, number
	dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL; 
	dma_init_struct.memory_addr = (uint32_t)&dma_buffer_color; 
	dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_DISABLE; 
	dma_init_struct.memory_width = DMA_MEMORY_WIDTH_16BIT; 			//Buffer 8 bits of data / transfer
	//dma_init_struct.number = (LCD_X_MAX * LCD_Y_MAX) << 1; 			//2 bytes per pixel. There are 240x240 pixels
	dma_init_struct.periph_addr = (uint32_t)((_spi_perpih) + 0x0CU);
	dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE; 
	dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_16BIT; 		//SPIx 8 bit data
	dma_init_struct.priority = DMA_PRIORITY_ULTRA_HIGH;				//Highest prio

	//dma_circulation_enable(dma_periph, dma_channel);

	dma_init(dma_periph, dma_channel, &dma_init_struct);
}

/**
 * @brief Preps DMA and SPI for transfer
 * @param[in]: number: Total amount of transfers.
 */
static void dma_prep_on(uint32_t number){
	
	dma_flag_clear(dma_periph, dma_channel, DMA_FLAG_FTF);				//clear full transfer flag
	//Turn off SPI and DMA for config
	spi_dma_disable(spi_perpih, SPI_DMA_TRANSMIT);
	dma_channel_disable(dma_periph, dma_channel);
	
	//Set SPI 16-bit data format
	spi_i2s_data_frame_format_config(spi_perpih, SPI_FRAMESIZE_16BIT);
	//Set number of DMA transfers
	dma_transfer_number_config(dma_periph, dma_channel, number); // Send 3 transfers
	
	//Activate SPI and DMA
	dma_channel_enable(dma_periph, dma_channel);
	spi_dma_enable(spi_perpih, SPI_DMA_TRANSMIT);
}

static void dma_prep_off(void){
	while ( !dma_flag_get(dma_periph, dma_channel, DMA_FLAG_FTF) );
	
	//Turn off SPI and DMA to config back to original settings
	spi_dma_disable(spi_perpih, SPI_DMA_TRANSMIT);				
	dma_channel_disable(dma_periph, dma_channel);						
	spi_i2s_data_frame_format_config(spi_perpih, SPI_FRAMESIZE_8BIT);	//Reset to 8-bit SPI data
	
	cs_set();															//Disable LCD chip
}
//DMA functions end 
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

