AntonG97/st7789vw-gd32-driver/src/sku22632.c
	//Select font
	uint8_t var_y;
	uint8_t *font_type;
	if( size == SMALL){};
	if( size == NORMAL) {var_y = STD_FONT_Y_SIZE; font_type = arial_normal;}
	if( size == BIG) {var_y = BIG_FONT_Y_SIZE; font_type = arial_big;}

	long BASE = 100000000;
	uint8_t ind = 0;
	while( (val / BASE) == 0 && BASE > 1) BASE /= 10;
	
	while( val > 0 && ind < 16 ){
		uint8_t curr_val = val / BASE;		//Get next MSB digit
		val -= (curr_val * BASE);			//Subtract
		BASE /= 10;							//Adjust base

		int offset = (var_y << 1) * (curr_val + '0' - ' ');								//Get correct character
	
		//Set window size
		uint8_t x = xs - (STD_FONT_X_SIZE >> 1) + (STD_FONT_X_SIZE * ind);				//Calc leftmost corner...
		uint8_t y = ys - (var_y >> 1);							
		setWindow(x, x + STD_FONT_X_SIZE - 1, y, y + var_y - 1);						//... and set window
	
		//Write char
		for(uint8_t i = 0; i < (var_y << 1); i++){
			for(int8_t j = 7; j >= 0; j--){
				//Check each bit of each element. If 0b1 => Write new col, else keep current background color
				color set_color = ( (((font_type[i + offset] >> j) & 1U ) == 1 ) ? _color : curr_backgr); 
				lcd_wr_data((set_color >> 8) & 0xFF);  			// High byte
				lcd_wr_data(set_color & 0xFF);  				// Low byte
			}
		}
		ind++;		//Increment index var
	}
}

/**
 * @brief Writes a float number on LCD
 * @param[in]: xs: Center x coordinate
 * @param[in]: ys: Center y coordinate
 * @param[in]: val: float val to be written
 * @param[in]: decim_pt: Amount of decimals
 * @param[in]: _color: Color of val
 * @param[in]: size: Size of val
 */
void lcd_showNum_float(const uint16_t xs, const uint16_t ys, const float val, uint8_t decim_pt, const color _color, const font_size size){

	//int decimal_points = 10 * 100000000;
	//Integral
	//.
	//Decimal
	int integral_val = val;										//Get integral part of val
	int decimal_val = (val - integral_val) * 100000000;			//Get decimal part of val
	
    if (val == 0) {
    lcd_ShowCh(xs, ys,'0', _color, size);
    return;
	}

	//Select font
	uint8_t var_y;
	uint8_t *font_type;
	if( size == SMALL){};
	if( size == NORMAL) {var_y = STD_FONT_Y_SIZE; font_type = arial_normal;}
	if( size == BIG) {var_y = BIG_FONT_Y_SIZE; font_type = arial_big;}

	long BASE = 100000000;
	uint8_t ind = 0;
	while( (integral_val / BASE) == 0 && BASE > 1) BASE /= 10;
	while( integral_val > 0 && ind < 16 ){
		uint8_t curr_val = integral_val / BASE;		//Get next MSB digit
		integral_val -= (curr_val * BASE);			//Subtract
		BASE /= 10;									//Adjust base

		int offset = (var_y << 1) * (curr_val + '0' - ' ');								//Get correct character
	
		//Set window size
		uint8_t x = xs - (STD_FONT_X_SIZE >> 1) + (STD_FONT_X_SIZE * ind);				//Calc leftmost corner...
		uint8_t y = ys - (var_y >> 1);							
		setWindow(x, x + STD_FONT_X_SIZE - 1, y, y + var_y - 1);						//... and set window
	
		//Write char
		for(uint8_t i = 0; i < (var_y << 1); i++){
			for(int8_t j = 7; j >= 0; j--){
				//Check each bit of each element. If 0b1 => Write new col, else keep current background color
				color set_color = ( (((font_type[i + offset] >> j) & 1U ) == 1 ) ? _color : curr_backgr); 
				lcd_wr_data((set_color >> 8) & 0xFF);  			// High byte
				lcd_wr_data(set_color & 0xFF);  				// Low byte
			}
		}
		ind++;		//Increment index var
	}

	//Decimal point
	lcd_ShowCh(xs + (STD_FONT_X_SIZE * ind ), ys, '.', _color, size);
	ind++;


	BASE = 100000000;
	while( (decimal_val / BASE) == 0 && BASE > 1 ) BASE /= 10;
	while( decimal_val > 0 && ind < 16 && decim_pt > 0){

		decim_pt--;

		uint8_t curr_val = decimal_val / BASE;		//Get next MSB digit
		decimal_val -= (curr_val * BASE);			//Subtract
		BASE /= 10;									//Adjust base

		int offset = (var_y << 1) * (curr_val + '0' - ' ');								//Get correct character
	
		//Set window size
		uint8_t x = xs - (STD_FONT_X_SIZE >> 1) + (STD_FONT_X_SIZE * ind);				//Calc leftmost corner...
		uint8_t y = ys - (var_y >> 1);							
		setWindow(x, x + STD_FONT_X_SIZE - 1, y, y + var_y - 1);						//... and set window
	
		//Write char
		for(uint8_t i = 0; i < (var_y << 1); i++){
			for(int8_t j = 7; j >= 0; j--){
				//Check each bit of each element. If 0b1 => Write new col, else keep current background color
				color set_color = ( (((font_type[i + offset] >> j) & 1U ) == 1 ) ? _color : curr_backgr); 
				lcd_wr_data((set_color >> 8) & 0xFF);  			// High byte
				lcd_wr_data(set_color & 0xFF);  				// Low byte
			}
		}
		ind++;		//Increment index var
	}
}

/**
 * @brief Draws picture on LCD.
 * @param[in]: bitMap: Pointer to bitmap of 240x240 / 8 bytes
 */
void lcd_showPicture(uint8_t *bitMap){
    setWindow(0, LCD_X_MAX - 1, 0, LCD_Y_MAX - 1);  

    for (uint16_t y = 0; y < LCD_Y_MAX; y++) {
        for (uint16_t x = 0; x < LCD_X_MAX; x++) {
            uint32_t pixelIndex = y * LCD_X_MAX + x;	//Pixel index
            uint32_t byteIndex = pixelIndex / 8;		//Byte index
            uint8_t bitIndex = 7 - (pixelIndex % 8);  	//MSB first

            uint8_t byte = bitMap[byteIndex];		
            uint8_t bit = (byte >> bitIndex) & 0x01;	

            color set_color = (bit == 1) ? BLACK : WHITE;

            lcd_wr_data((set_color >> 8) & 0xFF);  		// High byte
            lcd_wr_data(set_color & 0xFF);         		// Low byte
        }
    }
}



void lcd_dma_clear(color color){

	curr_backgr = color;

	//setWindow(0, LCD_X_MAX, 0, LCD_Y_MAX);				//Set window
	//lcd_queue_flush_blocking();

	cs_clr();
	dc_set();

	
	dma_buffer_color = (uint16_t)color;
	dma_prep_on(LCD_X_MAX * LCD_Y_MAX);

	dma_prep_off();

	// 5. Vänta på DMA-sändning
	while ( !dma_flag_get(dma_periph, dma_channel, DMA_FLAG_FTF) );
	spi_disable(spi_perpih);
	//spi_i2s_data_frame_format_config(spi_perpih, SPI_FRAMESIZE_8BIT);
	spi_dma_disable(spi_perpih, SPI_DMA_TRANSMIT);
	dma_channel_disable(dma_periph, dma_channel);
	spi_i2s_data_frame_format_config(spi_perpih, SPI_FRAMESIZE_8BIT);
	spi_enable(spi_perpih);
}
//LCD functions ends
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////